#### Category Members

---

|  |
| --- |
| Category Class   Methods   Properties   See Also |

The  Category  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method Static member | GetBuiltInCategory | Gets the BuiltInCategory value corresponding to the given built-in category identifier. |
| Public method Static member | GetBuiltInCategoryTypeId | Gets the ForgeTypeId identifying the given built-in category. |
| Public method Static member | GetCategory(Document, BuiltInCategory) | Retrieves a category object corresponding to a BuiltInCategory id. |
| Public method Static member | GetCategory(Document, ElementId) | Retrieves a category object corresponding to the category id. |
| Public method | GetGraphicsStyle | Gets the graphics style associated with this category for the given graphics style type. |
| Public method | GetHashCode | (Overrides  Object GetHashCode  .) |
| Public method | GetLinePatternId | Gets the line pattern id associated with this category for the given graphics style type. |
| Public method | GetLineWeight | Retrieves the line weight assigned to the category for the given graphics style type. |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | IsBuiltInCategory | Checks whether a ForgeTypeId identifies a built-in category. |
| Public method Static member | IsBuiltInCategoryValid | Checks if a Category exists for a given BuiltInCategory. |
| Public method | SetLinePatternId | Sets the line pattern id associated with this category for the given graphics style type. |
| Public method | SetLineWeight | Sets the line weight for the given graphics style type. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | AllowsBoundParameters | To check if the category can have project parameters. |
| Public property | AllowsVisibilityControl | Whether the visibility can be controlled by the user for this category in this view. |
| Public property | BuiltInCategory | Gets the  BuiltInCategory  value for this category. |
| Public property | CanAddSubcategory | Indicates if subcategories can be assigned to the category. |
| Public property | CategoryType | Gets the category type of this category. |
| Public property | HasMaterialQuantities | Identifies if elements of the category are able to report what materials they contain in what quantities. |
| Public property | Id | Returns the category id associated with the category object. |
| Public property | IsCuttable | Indicates if the category is cuttable or not. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | IsTagCategory | Identifies if the category is associated with a type of tag for a different category. |
| Public property | IsVisibleInUI | Identifies if the category is visible to the user and should be displayed in UI. |
| Public property | LineColor | The color of lines shown for elements of this category. |
| Public property | Material | Retrieves or changes the material of the category. |
| Public property | Name | The category name. |
| Public property | Parent | Returns the parent category of this category. |
| Public property | SubCategories | Returns a map containing all of the subcategories of this category. |
| Public property | Visible | Retrieves or changes the visibility of the category in the active view. |

# See Also

Category Class

Autodesk.Revit.DB Namespace